In [55]:
import numpy as np
import pandas as pd

In [57]:
#pandas.Series(data,index,datatype)
import pandas as pd
series=pd.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [59]:
import pandas as pd
import numpy as np
series1=pd.Series([1,2,3,4,5] ,index=['a','b','c','d','e'])
print(series1)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [61]:
import pandas as pd
import numpy as np

series2 = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(series2)

a    0.298154
b   -1.615226
c   -1.368801
d    1.427327
e   -0.217181
dtype: float64

In [63]:
dictionary={'a':1, 'b':2, 'c':3}
d1=pd.Series(dictionary)
d1

a    1
b    2
c    3
dtype: int64

In [65]:
#d1[[1,2]]
d1.iloc[[1,2]]

b    2
c    3
dtype: int64

In [67]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [69]:
df = pd.DataFrame(columns = ['C1', 'C2','C3'])
print(df)

Empty DataFrame
Columns: [C1, C2, C3]
Index: []

In [71]:
# create a dataframes using list
mylist = [
    ['Apple','Red'],
    ['Bannana','Yellow'],
    ['Orange','orange']
]
mydata=pd.DataFrame(mylist)
mydata

         0       1
0    Apple     Red
1  Bannana  Yellow
2   Orange  orange

In [73]:
import numpy as np
import pandas as pd

mylist1 = np.array([
    [0, 1],
    [2, 3],
    [4, 5]
])

mydf1 = pd.DataFrame(mylist1, columns=['Even', 'Odd'])
print(mydf1)

   Even  Odd
0     0    1
1     2    3
2     4    5

In [75]:
df = pd.read_csv(r'C:\Users\mahin\Downloads\cereals.csv')
df

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4             Almond Delight       110        2        25  34.384843
5    Apple Cinnamon Cheerios       110        2        25  29.509541
6                Apple Jacks       110        2        25  33.174094
7                    Basic 4       130        3        25  37.038562
8                  Bran Chex        90        2        25  49.120253
9                Bran Flakes        90        3        25  53.313813

In [77]:
df[1:4]

                        name  calories  protein  vitamins     rating
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912

In [79]:
df['calories','rating']#in single diamension, we cannot call multiple columns (error)

KeyError: ('calories', 'rating')

In [81]:
df[['calories','rating']]

   calories     rating
0        70  68.402973
1       120  33.983679
2        70  59.425505
3        50  93.704912
4       110  34.384843
5       110  29.509541
6       110  33.174094
7       130  37.038562
8        90  49.120253
9        90  53.313813

In [83]:
df1['calories']>70

0    False
1     True
2    False
3    False
4     True
Name: calories, dtype: bool

In [85]:
condition=df['calories']>70
df[condition]

                      name  calories  protein  vitamins     rating
1        100% Natural Bran       120        3         0  33.983679
4           Almond Delight       110        2        25  34.384843
5  Apple Cinnamon Cheerios       110        2        25  29.509541
6              Apple Jacks       110        2        25  33.174094
7                  Basic 4       130        3        25  37.038562
8                Bran Chex        90        2        25  49.120253
9              Bran Flakes        90        3        25  53.313813

In [87]:
#filtering row usinf &(and) and l(or) operators
df[(df['calories']>70) & (df['protein']<3)]

                      name  calories  protein  vitamins     rating
4           Almond Delight       110        2        25  34.384843
5  Apple Cinnamon Cheerios       110        2        25  29.509541
6              Apple Jacks       110        2        25  33.174094
8                Bran Chex        90        2        25  49.120253

In [89]:
df[(df['calories']>70) | (df['protein']<3)]

                      name  calories  protein  vitamins     rating
1        100% Natural Bran       120        3         0  33.983679
4           Almond Delight       110        2        25  34.384843
5  Apple Cinnamon Cheerios       110        2        25  29.509541
6              Apple Jacks       110        2        25  33.174094
7                  Basic 4       130        3        25  37.038562
8                Bran Chex        90        2        25  49.120253
9              Bran Flakes        90        3        25  53.313813

In [91]:
#using loc()
df.loc[2,'protein']

4

In [93]:
df.loc[0:4,['protein','name']]

   protein                       name
0        4                  100% Bran
1        3          100% Natural Bran
2        4                   All-Bran
3        4  All-Bran with Extra Fiber
4        2             Almond Delight

In [95]:
df.loc[[5],'protein']

5    2
Name: protein, dtype: int64

In [97]:
df[0:5]

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4             Almond Delight       110        2        25  34.384843

In [83]:
df.loc[0:4,'name':'protein']

                        name  calories  protein
0                  100% Bran        70        4
1          100% Natural Bran       120        3
2                   All-Bran        70        4
3  All-Bran with Extra Fiber        50        4
4             Almond Delight       110        2

In [103]:
df.columns

Index(['name', 'calories', 'protein', 'vitamins', 'rating'], dtype='object')

In [122]:
df2=df2.reset_index(drop= True)

In [124]:
df2

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4             Almond Delight       110        2        25  34.384843

In [126]:
pd.concat([df,df1],ignore_index=True)

                         name  calories  protein  vitamins     rating
0                   100% Bran        70        4        25  68.402973
1           100% Natural Bran       120        3         0  33.983679
2                    All-Bran        70        4        25  59.425505
3   All-Bran with Extra Fiber        50        4        25  93.704912
4              Almond Delight       110        2        25  34.384843
5     Apple Cinnamon Cheerios       110        2        25  29.509541
6                 Apple Jacks       110        2        25  33.174094
7                     Basic 4       130        3        25  37.038562
8                   Bran Chex        90        2        25  49.120253
9                 Bran Flakes        90        3        25  53.313813
10                  100% Bran        70        4        25  68.402973
11          100% Natural Bran       120        3         0  33.983679
12                   All-Bran        70        4        25  59.425505
13  All-Bran with Extra Fiber        50        4        25  93.704912
14             Almond Delight       110        2        25  34.384843

In [132]:
pd.concat([df,df1],ignore_index=False)

                        name  calories  protein  vitamins     rating
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4             Almond Delight       110        2        25  34.384843
5    Apple Cinnamon Cheerios       110        2        25  29.509541
6                Apple Jacks       110        2        25  33.174094
7                    Basic 4       130        3        25  37.038562
8                  Bran Chex        90        2        25  49.120253
9                Bran Flakes        90        3        25  53.313813
0                  100% Bran        70        4        25  68.402973
1          100% Natural Bran       120        3         0  33.983679
2                   All-Bran        70        4        25  59.425505
3  All-Bran with Extra Fiber        50        4        25  93.704912
4             Almond Delight       110        2        25  34.384843

In [135]:
#groupby

In [139]:
data={'Gender':['female','male','female','male'], 'Score':[56,78,89,93]}
new_df=pd.DataFrame(data)

In [141]:
new_df

   Gender  Score
0  female     56
1    male     78
2  female     89
3    male     93

In [146]:
group=new_df.groupby(new_df['Gender']).mean()
group

        Score
Gender
female   72.5
male     85.5

In [148]:
group=new_df.groupby(new_df['Gender']).max()
group

        Score
Gender
female     89
male       93

In [150]:
group=new_df.groupby(new_df['Gender']).std()
group

            Score
Gender
female  23.334524
male    10.606602

In [152]:
group=new_df.groupby(new_df['Gender']).sum()
group

        Score
Gender
female    145
male      171

In [154]:
group=new_df.groupby(new_df['Gender']).min()
group

        Score
Gender
female     56
male       78

In [7]:
import pandas as pd
data={'name':['ram','sita','raj','riya'], 'age':[22,24,26,21]}
data1=pd.DataFrame(data)

In [9]:
data1

   name  age
0   ram   22
1  sita   24
2   raj   26
3  riya   21

In [20]:
import pandas as pd

data = {'age:': [23, 25, 23, 30, 25, 25, 30, 23]}
df = pd.DataFrame(data)
mode_value = df['age:'].mode()
print(mode_value)  # This will return the most frequent age(s)

0    23
1    25
Name: age:, dtype: int64

In [25]:
import pandas as pd

# Creating a DataFrame with NaN values
data = {'Name': ['Alice', 'Bob', 'Charlie', None],
        'Age': [25, None, 30, 28]}

df = pd.DataFrame(data)

# Fill NaN values with a default value
df_filled = df.fillna("Unknown")  # Replaces None with "Unknown"
print(df_filled)

      Name      Age
0    Alice     25.0
1      Bob  Unknown
2  Charlie     30.0
3  Unknown     28.0